Охотники_и_рыболовы/src/Documents/УстановкаОбщихКвот/УстановкаОбщихКвот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаОбщихКвот</name>
  <registerRecords>AccumulationRegister.ОбщиеКвотыНаОхотхозяйство</registerRecords>
  <attributes>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставДичи</name>
    <attributes>
      <name>ВидДичи</name>
      <type>
        <types>CatalogRef.ВидыДичи</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщееКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Охотники_и_рыболовы/src/AccumulationRegisters/ОбщиеКвотыНаОхотхозяйство/ОбщиеКвотыНаОхотхозяйство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОбщиеКвотыНаОхотхозяйство</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Охотники_и_рыболовы/src/Documents/УстановкаОбщихКвот/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ОбщиеКвотыНаОхотхозяйство.Очистить();
	Движения.ОбщиеКвотыНаОхотхозяйство.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаОбщихКвотСоставДичи.Ссылка.СезонОхоты.ДатаНачала КАК Период,
		|	УстановкаОбщихКвотСоставДичи.Ссылка.Охотхозяйство,
		|	УстановкаОбщихКвотСоставДичи.ВидДичи,
		|	УстановкаОбщихКвотСоставДичи.ОбщееКоличество КАК Количество,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	УстановкаОбщихКвотСоставДичи.Ссылка.СезонОхоты
		|ИЗ
		|	Документ.УстановкаОбщихКвот.СоставДичи КАК УстановкаОбщихКвотСоставДичи
		|ГДЕ
		|	УстановкаОбщихКвотСоставДичи.Ссылка = &Ссылка";

	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Движения.ОбщиеКвотыНаОхотхозяйство.Загрузить(Результат.Выгрузить());
		Движения.Записать();
		
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОбщиеКвотыНаОхотхозяйствоОстатки.ВидДичи.Представление КАК ВидДичи,
			|	ОбщиеКвотыНаОхотхозяйствоОстатки.КоличествоОстаток
			|ИЗ
			|	РегистрНакопления.ОбщиеКвотыНаОхотхозяйство.Остатки(&Период, СезонОхоты = &СезонОхоты) КАК ОбщиеКвотыНаОхотхозяйствоОстатки
			|ГДЕ
			|	ОбщиеКвотыНаОхотхозяйствоОстатки.КоличествоОстаток < 0";
		
		Запрос.УстановитьПараметр("Период", '00010101');
		Запрос.УстановитьПараметр("СезонОхоты", СезонОхоты);
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Возврат;
		Иначе
			Выборка = Результат.Выбрать();
		    Отказ = Истина;
			Пока Выборка.Следующий() Цикл
				Текст = "По виду дичи " + Выборка.ВидДичи + " отрицательный остаток в количестве " + Выборка.КоличествоОстаток;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Текст");
			КонецЦикла;	
		КонецЕсли;
			
	КонецЕсли;	
КонецПроцедуры
